<div class="wrapped">
	<article>
		<h2></h2>
		<section>
			<h3></h3>
			<p></p>
		</section>
		<section>
			<h3></h3>
			<p></p>
		</section>
		<section>
			<h3></h3>
			<p></p>
		</section>
		<section>
			<h3></h3>
			<p></p>
		</section>
	</article>
	<script type="text/javascript">
		var learning = [
			[	"Учеба важнее всего", 'Что значит "Быть умным"?', "Я смогу!", "Информация - это сила"],
			[	'Прочитав столь громкий заголовок, вы наверняка возмутитесь: "Да как так то?", или "Да кто такое сказал?",\
				или что-то в этом роде. Представьте, что вы сидите в своей комнате, пытаетесь прочесть эту нудную книгу,\
				а за окном прекрасная погода, светит солнце, и ваши мысли где-то очень далеко, вы мечтаете о том, как вы\
				будете отдыхать на море, как вы будете проводить время в компании друзей. И вдруг "СТОП", вы ловите себя на мысли,\
				что уже прочли дюжину страниц,\
				но в голове так ничего и не отложилось. Это все потому, что ваш мозг активен в данный момент,\
				вы не сосредоточены на предмете изучения. Но представте ситуацию, что вы идете по улице и вдруг вам на встречу\
				выбегает огромная собака. Вы еще думаете о море, о шумной компании друзей? Ваш мозг активизировался и активно\
				ищет ответ: "Как спастись?". Так и в жизни, решение множества вопросов требуетзнаний и умений. Значит,\
				жизненные трудности - это собака, а учеба - это и есть ответ.',
				'Наверняка вы часто задавали себе этот вопрос. Если данная мысль посещает ваш мозг, то вы на верном пути. Быть умным,\
				означает постоянно работать над собой, активно проявлять умственную и физическую деятельность. Небольшое отступление:\
				"Занятия спортом улучшают работу головного мозга, что способствует лучшему усвоению материала". Согласитесь с тем фактом,\
				что с возрастом, активность людей снижается, они уже успели чему-то научиться и просто делают это изо дня в день.\
				От этого снижается умственная активность, да и как показывает практика, физическая тоже. А теперь взгляните на младшее\
				поколение. Оно всегда активно, им всё интересно. Быть умным, значит не потерять этот интерес к самообразованию.\
				И если вдруг ваши школьные показатели не на высшем уровне, или вам тяжело дается какой-либо материал,\
				- не опускайте руки. В мире нет "умных" и "глупых" людей, есть "трудолюбивые" и "ленивые". Безусловно при рождении\
				человек получает какой-то базовый набор психо-физиологических особенностей, от того-то и наблюдается небольшая разница\
				между восприятием материала у разных людей. Одним он дается легко, а другим значительно тяжелее. Это можно сравнить\
				со спортивным автомобилем и самолетом. Самолет при взлете развивает скорость около 200 км/ч, что является 1/5 от\
				номинальной мощности, в то время как максимально развиваемая скорость спорткара около 250 км/ч, а значит в\
				некоторые моменты времени машина движется быстрее чем самолет. Задумайтесь... Но не забывайте, что вы люди,\
				а не машины, и вашему совершенству нет предела.',
				'В реальной жизни каждый день идет борьба за свое место под солнцем. Как в обычной школе, ученики стараются\
				учиться лучше своих сверсников, так и, к примеру на работе, люди проявляют себя, для самореализации, для\
				создания лучших условий для жизни. И как правило у одних это  получается, а у других - нет. Если вы относитесь\
				ко второй категории, то ищите проблему в себе. Найдите то, что вам нравится делать, и  совершенствуйте себя\
				в этом направлении. Спросите себя: "Почему кто-то может, а я нет?", и приложите максимум усилий для достижения\
				поставленной цели.',
				'Оглянитесь вокруг. Все что вы видите - это результат многовекового интереса человека к познанию окружающего мира.\
				Земледелие, скотоводство, гончарное дело, орудия труда, письменность, математика, физика, химия, промышленность,\
				авиастроение, ИТ технологии, простите за такой  беспорядочный перечень отраслей науки, но все же, это все окружает\
				нас каждый день. Выберите что вам по душе и сделайте свой вклад в развитие данной отрасли науки. Люди, которые питали\
				интерес к познанию, добивались гораздо большего, чем те которые довольствовались малым. Только подумайте, ведь\
				пещерный человек, которого интересовало, что же там шумит в кустах, прожил дольше того, кого это не\
				интересовало вовсе.'
			]
		],
		about = [
			[	"Что представляет собой наш сайт", 'Кому предназначен наш сайт', "Феномен <span>S</span>mart <span>P</span>eople", "Уважаемые пользователи"],
			[	'В настоящее время, особой популярностью среди пользователей интернета, полузуются социальные сети. Мы последовали\
			сложившимся традициям и создали революционно новую социальную сеть. Но вот что касается контента сайта, то необходимо\
			отметить - он содержит научно-образовательный характер, и будет наполняться по мере развития SmartPeople. Пользователи\
			смогут зарегистрироваться в нашей сети с целью получения знаний, а простота изложенного контента поможет им в этом. Мы\
			называем нашу социальную сеть революционной потому, что в наше время сложилась тенденция нежелания учиться, а основная\
			её задача, как раз собрать большую аудиторию тех, кто еще не потерял интерес к изучению мира, а так же, безусловно,\
			донести этот интерес до тех людей, которые считают учёбу, основу любой науки, бесполезным делом. Мы искренне верим,\
			что с каждым новым днем существования SmartPeople, мир будет становиться немножко умнее.',
				'SmartPeople предназначается тем людям, которые питают интерес к образованию, к науке, а так же тем, которые хотят\
				поднять свой уровень знаний по конкретной дисциплине, в конкретной области изучения. Ученики школ, лицеев, колледжей,\
				институтов, университетов смогут разобраться с интересующими их вопросами благодаря нашей социальной сети,\
				поскольку мы предоставляем понятный контент, вызывающий интерес у учащегося, тем самым делая процесс обучения легче,\
				ведь каждый согласится с тем, что интересный материал усваивается быстрее и остается в памяти надолго.',
				'Феномен SmartPeople заключается в том, что проведенное время online будет подразумевать обучение, повышение\
				уровня своих знаний, закрепление их методом проверочных и тестовых online процедур. Построение функциональности\
				нашей социальной сети представляет собой некий алгоритм,  следуя которому, пользователь не будет думать о прекрасной\
				погоде за окном, о каких-либо незавершенных делах, он будет сосредоточен на изучении предоставленного материала, и на выходе покажет превосходный уровень знаний.',
				'Наверняка, дочитав до этого абзаца, у вас возникла мысль, а зачем для получения знаний нужна социальная сеть?\
				Почему нельзя просто найти интересующие материалы, выучить и все? Ответ таков, что эфект социальной сети, это\
				составляющая успешного усвоения материала, ведь по личным результатам будут составляться рейтинги успеваемости,\
				будет видна реальная динамика, будет присутствовать дух соперничества, а для всего  этого нужны реальные люди.\
				Но кроме того пользователи смогут общаться друг с другом посредством социальной сети, помагать друг другу,\
				а это  уже взаимопомощь. Мы в свою очередь хотим пожелать вам удачи во всех начинаниях, и добро пожаловать\
				в SmartPeople!'
			]
		],
		title = $("title").html();
		
		if (title === "О сайте") {
			links(about, title);
		}
		else if (title === "Как заставить себя учиться") {
			links(learning, title);
		}
		
		
		function links (array, h2) {
			var h = $("article h3"),
				p = $("article p");
				
			$("article h2").html(h2);
				
			for (var i = 0; i < array.length; i++) {
				for (var j = 0; j < array[i].length; j++) {
					function setH3 () {
						return array[0][j];
					}
					function setP () {
						return array[1][j];
					}
					h.eq(j).html(setH3());
					p.eq(j).html(setP());
				}
			}
		}
	</script>
</div>